package Lesson25;

public class Main {
}

//Lesson25.T01;

/*
Создать универсальный класс с именем Раг, который будет хранить пару значений, каждое из которых потенциально может иметь разные типы.
Затем создайте методы для получения и установки значений для каждого элемента в паре.
Наконец, реализуйте метод для обмена значениями между двумя разными объектами Pair, учитывая, что они имеют одинаковые типы
*/

//Lesson25.T02;

/*
Создайте универсальный интерфейс с именем «Процессор» с методом с именем «процесс», который принимает параметр универсального типа и возвращает значение универсального типа.
Реализуйте этот интерфейс в классе и переопределите метод процесса для выполнения некоторой операции.
*/